{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 128,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 1,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "afr_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "eng_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "xho_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 7,
      "content": "zul_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 8,
      "content": "<mask>",
      "single_word": false,
      "lstrip": true,
      "rstrip": false,
      "normalized": true,
      "special": true
    },
    {
      "id": 10000,
      "content": "nso_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10001,
      "content": "tsn_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10002,
      "content": "ace_Arab",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10003,
      "content": "ace_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10004,
      "content": "acm_Arab",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10005,
      "content": "acq_Arab",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10006,
      "content": "aeb_Arab",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10007,
      "content": "ajp_Arab",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10008,
      "content": "aka_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10009,
      "content": "amh_Ethi",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10010,
      "content": "apc_Arab",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10011,
      "content": "arb_Arab",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10012,
      "content": "ars_Arab",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10013,
      "content": "ary_Arab",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10014,
      "content": "arz_Arab",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10015,
      "content": "asm_Beng",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10016,
      "content": "ast_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10017,
      "content": "awa_Deva",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10018,
      "content": "ayr_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10019,
      "content": "azb_Arab",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10020,
      "content": "azj_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10021,
      "content": "bak_Cyrl",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10022,
      "content": "bam_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10023,
      "content": "ban_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10024,
      "content": "bel_Cyrl",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10025,
      "content": "bem_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10026,
      "content": "ben_Beng",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10027,
      "content": "bho_Deva",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10028,
      "content": "bjn_Arab",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10029,
      "content": "bjn_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10030,
      "content": "bod_Tibt",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10031,
      "content": "bos_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10032,
      "content": "bug_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10033,
      "content": "bul_Cyrl",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10034,
      "content": "cat_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10035,
      "content": "ceb_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10036,
      "content": "ces_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10037,
      "content": "cjk_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10038,
      "content": "ckb_Arab",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10039,
      "content": "crh_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10040,
      "content": "cym_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10041,
      "content": "dan_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10042,
      "content": "deu_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10043,
      "content": "dik_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10044,
      "content": "dyu_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10045,
      "content": "dzo_Tibt",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10046,
      "content": "ell_Grek",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10047,
      "content": "epo_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10048,
      "content": "est_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10049,
      "content": "eus_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10050,
      "content": "ewe_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10051,
      "content": "fao_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10052,
      "content": "pes_Arab",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10053,
      "content": "fij_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10054,
      "content": "fin_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10055,
      "content": "fon_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10056,
      "content": "fra_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10057,
      "content": "fur_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10058,
      "content": "fuv_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10059,
      "content": "gla_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10060,
      "content": "gle_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10061,
      "content": "glg_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10062,
      "content": "grn_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10063,
      "content": "guj_Gujr",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10064,
      "content": "hat_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10065,
      "content": "hau_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10066,
      "content": "heb_Hebr",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10067,
      "content": "hin_Deva",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10068,
      "content": "hne_Deva",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10069,
      "content": "hrv_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10070,
      "content": "hun_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10071,
      "content": "hye_Armn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10072,
      "content": "ibo_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10073,
      "content": "ilo_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10074,
      "content": "ind_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10075,
      "content": "isl_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10076,
      "content": "ita_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10077,
      "content": "jav_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10078,
      "content": "jpn_Jpan",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10079,
      "content": "kab_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10080,
      "content": "kac_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10081,
      "content": "kam_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10082,
      "content": "kan_Knda",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10083,
      "content": "kas_Arab",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10084,
      "content": "kas_Deva",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10085,
      "content": "kat_Geor",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10086,
      "content": "knc_Arab",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10087,
      "content": "knc_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10088,
      "content": "kaz_Cyrl",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10089,
      "content": "kbp_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10090,
      "content": "kea_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10091,
      "content": "khm_Khmr",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10092,
      "content": "kik_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10093,
      "content": "kin_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10094,
      "content": "kir_Cyrl",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10095,
      "content": "kmb_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10096,
      "content": "kon_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10097,
      "content": "kor_Hang",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10098,
      "content": "kmr_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10099,
      "content": "lao_Laoo",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10100,
      "content": "lvs_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10101,
      "content": "lij_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10102,
      "content": "lim_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10103,
      "content": "lin_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10104,
      "content": "lit_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10105,
      "content": "lmo_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10106,
      "content": "ltg_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10107,
      "content": "ltz_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10108,
      "content": "lua_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10109,
      "content": "lug_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10110,
      "content": "luo_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10111,
      "content": "lus_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10112,
      "content": "mag_Deva",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10113,
      "content": "mai_Deva",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10114,
      "content": "mal_Mlym",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10115,
      "content": "mar_Deva",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10116,
      "content": "min_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10117,
      "content": "mkd_Cyrl",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10118,
      "content": "plt_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10119,
      "content": "mlt_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10120,
      "content": "mni_Beng",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10121,
      "content": "khk_Cyrl",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10122,
      "content": "mos_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10123,
      "content": "mri_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10124,
      "content": "zsm_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10125,
      "content": "mya_Mymr",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10126,
      "content": "nld_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10127,
      "content": "nno_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10128,
      "content": "nob_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10129,
      "content": "npi_Deva",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10130,
      "content": "nus_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10131,
      "content": "nya_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10132,
      "content": "oci_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10133,
      "content": "gaz_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10134,
      "content": "ory_Orya",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10135,
      "content": "pag_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10136,
      "content": "pan_Guru",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10137,
      "content": "pap_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10138,
      "content": "pol_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10139,
      "content": "por_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10140,
      "content": "prs_Arab",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10141,
      "content": "pbt_Arab",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10142,
      "content": "quy_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10143,
      "content": "ron_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10144,
      "content": "run_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10145,
      "content": "rus_Cyrl",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10146,
      "content": "sag_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10147,
      "content": "san_Deva",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10148,
      "content": "sat_Beng",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10149,
      "content": "scn_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10150,
      "content": "shn_Mymr",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10151,
      "content": "sin_Sinh",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10152,
      "content": "slk_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10153,
      "content": "slv_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10154,
      "content": "smo_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10155,
      "content": "sna_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10156,
      "content": "snd_Arab",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10157,
      "content": "som_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10158,
      "content": "sot_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10159,
      "content": "spa_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10160,
      "content": "als_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10161,
      "content": "srd_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10162,
      "content": "srp_Cyrl",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10163,
      "content": "ssw_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10164,
      "content": "sun_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10165,
      "content": "swe_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10166,
      "content": "swh_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10167,
      "content": "szl_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10168,
      "content": "tam_Taml",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10169,
      "content": "tat_Cyrl",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10170,
      "content": "tel_Telu",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10171,
      "content": "tgk_Cyrl",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10172,
      "content": "tgl_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10173,
      "content": "tha_Thai",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10174,
      "content": "tir_Ethi",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10175,
      "content": "taq_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10176,
      "content": "taq_Tfng",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10177,
      "content": "tpi_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10178,
      "content": "tso_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10179,
      "content": "tuk_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10180,
      "content": "tum_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10181,
      "content": "tur_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10182,
      "content": "twi_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10183,
      "content": "tzm_Tfng",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10184,
      "content": "uig_Arab",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10185,
      "content": "ukr_Cyrl",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10186,
      "content": "umb_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10187,
      "content": "urd_Arab",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10188,
      "content": "uzn_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10189,
      "content": "vec_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10190,
      "content": "vie_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10191,
      "content": "war_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10192,
      "content": "wol_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10193,
      "content": "ydd_Hebr",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10194,
      "content": "yor_Latn",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10195,
      "content": "yue_Hant",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10196,
      "content": "zho_Hans",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10197,
      "content": "zho_Hant",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "NFKC"
  },
  "pre_tokenizer": {
    "type": "Metaspace",
    "replacement": "▁",
    "prepend_scheme": "always",
    "split": true
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "eng_Latn",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "</s>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "eng_Latn",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "</s>",
          "type_id": 0
        }
      }
    ],
    "special_tokens": {
      "</s>": {
        "id": "</s>",
        "ids": [
          2
        ],
        "tokens": [
          "</s>"
        ]
      },
      "eng_Latn": {
        "id": "eng_Latn",
        "ids": [
          5
        ],
        "tokens": [
          "eng_Latn"
        ]
      }
    }
  },
  "decoder": {
    "type": "Metaspace",
    "replacement": "▁",
    "prepend_scheme": "always",
    "split": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<s>": 0,
      "<pad>": 1,
      "</s>": 2,
      "<unk>": 3,
      "afr_Latn": 4,
      "eng_Latn": 5,
      "xho_Latn": 6,
      "zul_Latn": 7,
      "<mask>": 8,
      "\n": 9,
      "!": 10,
      "\"": 11,
      "#": 12,
      "$": 13,
      "%": 14,
      "&": 15,
      "'": 16,
      "(": 17,
      ")": 18,
      "*": 19,
      "+": 20,
      ",": 21,
      "-": 22,
      ".": 23,
      "/": 24,
      "0": 25,
      "1": 26,
      "2": 27,
      "3": 28,
      "4": 29,
      "5": 30,
      "6": 31,
      "7": 32,
      "8": 33,
      "9": 34,
      ":": 35,
      ";": 36,
      "<": 37,
      "=": 38,
      ">": 39,
      "?": 40,
      "@": 41,
      "A": 42,
      "B": 43,
      "C": 44,
      "D": 45,
      "E": 46,
      "F": 47,
      "G": 48,
      "H": 49,
      "I": 50,
      "J": 51,
      "K": 52,
      "L": 53,
      "M": 54,
      "N": 55,
      "O": 56,
      "P": 57,
      "Q": 58,
      "R": 59,
      "S": 60,
      "T": 61,
      "U": 62,
      "V": 63,
      "W": 64,
      "X": 65,
      "Y": 66,
      "Z": 67,
      "[": 68,
      "\\": 69,
      "]": 70,
      "^": 71,
      "_": 72,
      "a": 73,
      "b": 74,
      "c": 75,
      "d": 76,
      "e": 77,
      "f": 78,
      "g": 79,
      "h": 80,
      "i": 81,
      "j": 82,
      "k": 83,
      "l": 84,
      "m": 85,
      "n": 86,
      "o": 87,
      "p": 88,
      "q": 89,
      "r": 90,
      "s": 91,
      "t": 92,
      "u": 93,
      "v": 94,
      "w": 95,
      "x": 96,
      "y": 97,
      "z": 98,
      "{": 99,
      "|": 100,
      "}": 101,
      "~": 102,
      "¡": 103,
      "¢": 104,
      "£": 105,
      "¤": 106,
      "¥": 107,
      "¦": 108,
      "§": 109,
      "©": 110,
      "¬": 111,
      "®": 112,
      "°": 113,
      "±": 114,
      "¶": 115,
      "·": 116,
      "¿": 117,
      "À": 118,
      "Á": 119,
      "Â": 120,
      "Ã": 121,
      "Ä": 122,
      "Å": 123,
      "Ç": 124,
      "É": 125,
      "Ê": 126,
      "Ë": 127,
      "Í": 128,
      "Ó": 129,
      "Ö": 130,
      "×": 131,
      "Ø": 132,
      "Ü": 133,
      "ß": 134,
      "à": 135,
      "á": 136,
      "â": 137,
      "ã": 138,
      "ä": 139,
      "å": 140,
      "æ": 141,
      "ç": 142,
      "è": 143,
      "é": 144,
      "ê": 145,
      "ë": 146,
      "ì": 147,
      "í": 148,
      "î": 149,
      "ï": 150,
      "ð": 151,
      "ñ": 152,
      "ò": 153,
      "ó": 154,
      "ô": 155,
      "õ": 156,
      "ö": 157,
      "÷": 158,
      "ø": 159,
      "ù": 160,
      "ú": 161,
      "û": 162,
      "ü": 163,
      "ý": 164,
      "ā": 165,
      "ă": 166,
      "ć": 167,
      "č": 168,
      "ē": 169,
      "ę": 170,
      "ğ": 171,
      "ī": 172,
      "İ": 173,
      "ı": 174,
      "ł": 175,
      "ń": 176,
      "ŋ": 177,
      "ō": 178,
      "œ": 179,
      "ř": 180,
      "ś": 181,
      "Ş": 182,
      "ş": 183,
      "Š": 184,
      "š": 185,
      "ū": 186,
      "ż": 187,
      "Ž": 188,
      "ž": 189,
      "ɑ": 190,
      "ɔ": 191,
      "ə": 192,
      "ɛ": 193,
      "ɨ": 194,
      "ɪ": 195,
      "ʔ": 196,
      "ʹ": 197,
      "ʻ": 198,
      "ʼ": 199,
      "ˈ": 200,
      "ː": 201,
      "̃": 202,
      "̄": 203,
      "̅": 204,
      "̈": 205,
      "̧": 206,
      "̱": 207,
      "Α": 208,
      "Ε": 209,
      "Κ": 210,
      "Μ": 211,
      "Π": 212,
      "Σ": 213,
      "Τ": 214,
      "Φ": 215,
      "Ω": 216,
      "ά": 217,
      "έ": 218,
      "ή": 219,
      "ί": 220,
      "α": 221,
      "β": 222,
      "γ": 223,
      "δ": 224,
      "ε": 225,
      "η": 226,
      "θ": 227,
      "ι": 228,
      "κ": 229,
      "λ": 230,
      "μ": 231,
      "ν": 232,
      "ο": 233,
      "π": 234,
      "ρ": 235,
      "ς": 236,
      "σ": 237,
      "τ": 238,
      "υ": 239,
      "φ": 240,
      "χ": 241,
      "ω": 242,
      "ό": 243,
      "ύ": 244,
      "А": 245,
      "Б": 246,
      "В": 247,
      "Г": 248,
      "Д": 249,
      "Е": 250,
      "З": 251,
      "И": 252,
      "К": 253,
      "Л": 254,
      "М": 255,
      "Н": 256,
      "О": 257,
      "П": 258,
      "Р": 259,
      "С": 260,
      "Т": 261,
      "У": 262,
      "Ф": 263,
      "Х": 264,
      "Ч": 265,
      "Ш": 266,
      "Э": 267,
      "Ю": 268,
      "Я": 269,
      "а": 270,
      "б": 271,
      "в": 272,
      "г": 273,
      "д": 274,
      "е": 275,
      "ж": 276,
      "з": 277,
      "и": 278,
      "й": 279,
      "к": 280,
      "л": 281,
      "м": 282,
      "н": 283,
      "о": 284,
      "п": 285,
      "р": 286,
      "с": 287,
      "т": 288,
      "у": 289,
      "ф": 290,
      "х": 291,
      "ц": 292,
      "ч": 293,
      "ш": 294,
      "щ": 295,
      "ы": 296,
      "ь": 297,
      "э": 298,
      "ю": 299,
      "я": 300,
      "ѕ": 301,
      "і": 302,
      "ա": 303,
      "ե": 304,
      "ի": 305,
      "լ": 306,
      "կ": 307,
      "մ": 308,
      "յ": 309,
      "ն": 310,
      "ո": 311,
      "ս": 312,
      "տ": 313,
      "ր": 314,
      "ւ": 315,
      "ָ": 316,
      "א": 317,
      "ב": 318,
      "ג": 319,
      "ד": 320,
      "ה": 321,
      "ו": 322,
      "ז": 323,
      "ח": 324,
      "ט": 325,
      "י": 326,
      "כ": 327,
      "ל": 328,
      "ם": 329,
      "מ": 330,
      "ן": 331,
      "נ": 332,
      "ס": 333,
      "ע": 334,
      "פ": 335,
      "ק": 336,
      "ר": 337,
      "ש": 338,
      "ת": 339,
      "،": 340,
      "أ": 341,
      "ا": 342,
      "ب": 343,
      "ة": 344,
      "ت": 345,
      "ج": 346,
      "ح": 347,
      "خ": 348,
      "د": 349,
      "ر": 350,
      "ز": 351,
      "س": 352,
      "ش": 353,
      "ص": 354,
      "ط": 355,
      "ظ": 356,
      "ع": 357,
      "غ": 358,
      "ـ": 359,
      "ف": 360,
      "ق": 361,
      "ك": 362,
      "ل": 363,
      "م": 364,
      "ن": 365,
      "ه": 366,
      "و": 367,
      "ي": 368,
      "َ": 369,
      "ُ": 370,
      "ِ": 371,
      "پ": 372,
      "ک": 373,
      "گ": 374,
      "ہ": 375,
      "ی": 376,
      "ं": 377,
      "अ": 378,
      "आ": 379,
      "इ": 380,
      "ए": 381,
      "क": 382,
      "ख": 383,
      "ग": 384,
      "च": 385,
      "ज": 386,
      "ट": 387,
      "ड": 388,
      "ण": 389,
      "त": 390,
      "थ": 391,
      "द": 392,
      "न": 393,
      "प": 394,
      "फ": 395,
      "ब": 396,
      "भ": 397,
      "म": 398,
      "य": 399,
      "र": 400,
      "ल": 401,
      "व": 402,
      "श": 403,
      "ष": 404,
      "स": 405,
      "ह": 406,
      "ा": 407,
      "ि": 408,
      "ी": 409,
      "ु": 410,
      "ू": 411,
      "े": 412,
      "ै": 413,
      "ो": 414,
      "्": 415,
      "ক": 416,
      "ট": 417,
      "ত": 418,
      "ন": 419,
      "প": 420,
      "ব": 421,
      "ম": 422,
      "য": 423,
      "র": 424,
      "ল": 425,
      "স": 426,
      "়": 427,
      "া": 428,
      "ি": 429,
      "ু": 430,
      "ে": 431,
      "্": 432,
      "ਨ": 433,
      "ਪ": 434,
      "ਲ": 435,
      "ਹ": 436,
      "ਾ": 437,
      "ਿ": 438,
      "ન": 439,
      "બ": 440,
      "િ": 441,
      "க": 442,
      "ச": 443,
      "ட": 444,
      "த": 445,
      "ந": 446,
      "ன": 447,
      "ப": 448,
      "ம": 449,
      "ய": 450,
      "ர": 451,
      "ல": 452,
      "ள": 453,
      "வ": 454,
      "ா": 455,
      "ி": 456,
      "ு": 457,
      "்": 458,
      "్": 459,
      "ക": 460,
      "ത": 461,
      "ാ": 462,
      "ി": 463,
      "ു": 464,
      "്": 465,
      "ก": 466,
      "ข": 467,
      "ค": 468,
      "ง": 469,
      "ช": 470,
      "ด": 471,
      "ต": 472,
      "ท": 473,
      "น": 474,
      "บ": 475,
      "ป": 476,
      "พ": 477,
      "ภ": 478,
      "ม": 479,
      "ย": 480,
      "ร": 481,
      "ล": 482,
      "ว": 483,
      "ส": 484,
      "ห": 485,
      "อ": 486,
      "ั": 487,
      "า": 488,
      "ิ": 489,
      "ี": 490,
      "ื": 491,
      "ู": 492,
      "เ": 493,
      "แ": 494,
      "่": 495,
      "้": 496,
      "์": 497,
      "ა": 498,
      "ბ": 499,
      "გ": 500,
      "დ": 501,
      "ე": 502,
      "ვ": 503,
      "თ": 504,
      "ი": 505,
      "ლ": 506,
      "მ": 507,
      "ნ": 508,
      "ო": 509,
      "რ": 510,
      "ს": 511,
      "უ": 512,
      "ḥ": 513,
      "ṃ": 514,
      "ṇ": 515,
      "ṛ": 516,
      "ṣ": 517,
      "ṭ": 518,
      "ẹ": 519,
      "ị": 520,
      "ọ": 521,
      "ụ": 522,
      "‐": 523,
      "―": 524,
      "†": 525,
      "‡": 526,
      "•": 527,
      " ": 528,
      "′": 529,
      "‹": 530,
      "›": 531,
      "⁄": 532,
      "€": 533,
      "←": 534,
      "↑": 535,
      "→": 536,
      "↓": 537,
      "−": 538,
      "√": 539,
      "∞": 540,
      "≤": 541,
      "≥": 542,
      "─": 543,
      "│": 544,
      "├": 545,
      "▁": 546,
      "▐": 547,
      "■": 548,
      "▪": 549,
      "▬": 550,
      "▶": 551,
      "▷": 552,
      "►": 553,
      "▼": 554,
      "◆": 555,
      "●": 556,
      "☀": 557,
      "★": 558,
      "☆": 559,
      "♡": 560,
      "♥": 561,
      "♦": 562,
      "♪": 563,
      "♫": 564,
      "♬": 565,
      "✅": 566,
      "✓": 567,
      "✔": 568,
      "❤": 569,
      "➜": 570,
      "➡": 571,
      "⠀": 572,
      "、": 573,
      "。": 574,
      "《": 575,
      "》": 576,
      "「": 577,
      "」": 578,
      "『": 579,
      "』": 580,
      "【": 581,
      "】": 582,
      "〜": 583,
      "あ": 584,
      "い": 585,
      "う": 586,
      "え": 587,
      "お": 588,
      "か": 589,
      "が": 590,
      "き": 591,
      "く": 592,
      "こ": 593,
      "さ": 594,
      "し": 595,
      "す": 596,
      "せ": 597,
      "そ": 598,
      "た": 599,
      "だ": 600,
      "ち": 601,
      "っ": 602,
      "つ": 603,
      "て": 604,
      "で": 605,
      "と": 606,
      "ど": 607,
      "な": 608,
      "に": 609,
      "ね": 610,
      "の": 611,
      "は": 612,
      "ま": 613,
      "み": 614,
      "め": 615,
      "も": 616,
      "や": 617,
      "よ": 618,
      "ら": 619,
      "り": 620,
      "る": 621,
      "れ": 622,
      "わ": 623,
      "を": 624,
      "ん": 625,
      "ア": 626,
      "ィ": 627,
